kirakiseki/ECGMonitor-XiUOS/xiuos/Ubiquitous/Nuttx_Fusion_XiUOS/aiit_board/xidatong-riscv64/src/k210_ch376.c
/*
* Copyright (c) 2020 AIIT XUOS Lab
* XiUOS is licensed under Mulan PSL v2.
* You can use this software according to the terms and conditions of the Mulan PSL v2.
* You may obtain a copy of Mulan PSL v2 at:
*        http://license.coscl.org.cn/MulanPSL2
* THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND,
* EITHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT,
* MERCHANTABILITY OR FIT FOR A PARTICULAR PURPOSE.
* See the Mulan PSL v2 for more details.
*/

/**
 * @file k210_ch376.c
 * @brief xidatong-riscv64 k210_ch376.c
 * @version 1.0
 * @author AIIT XUOS Lab
 * @date 2022.10.10
 */


#if 0
#define DEF_IC_V43_U    1
#endif

#include "k210_ch376.h"

/****************************************************************************
 * Private Data
 ****************************************************************************/
static int fd;

/* Serial port mode is not used */
void xEndCH376Cmd(void)
{
}

void xWriteCH376Cmd(UINT8 cmd)
{
    UINT8 temp[3];
    temp[0] = 0x57;
    temp[1] = 0xab;
    temp[2] = cmd;
    up_udelay(5);
    write(fd, temp, 3);
}

void xWriteCH376Data(UINT8 dat)
{
    UINT8 tmp = dat;
    write(fd, &tmp, 1);
    up_udelay(2);
}

UINT8 xReadCH376Data(void)
{
    UINT32 i;
    UINT8 data;
    int  res;
    for(i=0;i<500000;i++) 
    {
        res = read(fd, &data, 1);
        if(res == 1)
        {
            return ((UINT8)data);
        }
        up_udelay(1);
    }
    return ERR_USB_UNKNOWN;
}

UINT8 CH376ReadBlock(PUINT8 buf)
{
    UINT8 s, l;
    xWriteCH376Cmd( CMD01_RD_USB_DATA0 );
    s = l = xReadCH376Data( );
    if ( l ) {
        do {
            *buf = xReadCH376Data( );
            buf ++;
        } while ( -- l );
    }
    xEndCH376Cmd( );
    return( s );
}

UINT8 Query376Interrupt(void)
{
    //When an interrupt occurs, the serial port will receive a data, read it directly, and discard it
    if(xReadCH376Data() == ERR_USB_UNKNOWN) return FALSE ;
    else return TRUE ;
}

/* CH376 INIT */
UINT8 mInitCH376Host(void)
{
    UINT8 res;
    /* After power on, delay operation for at least 50ms */
    up_mdelay(50);
    fd = open("/dev/ttyS3", O_RDWR);
    up_mdelay(600);
    /* Test the communication interface between SCM and CH376 */
    xWriteCH376Cmd(CMD11_CHECK_EXIST);
    xWriteCH376Data(0x65);
    res = xReadCH376Data();
    xEndCH376Cmd();
    if ( res != 0x9A ) return( ERR_USB_UNKNOWN );

    xWriteCH376Cmd(CMD11_SET_USB_MODE);  /* SET USB MODE */
    xWriteCH376Data(CONFIG_CH376_WORK_MODE);
    up_udelay(20);
    res = xReadCH376Data();
    xEndCH376Cmd();
    if (res == CMD_RET_SUCCESS) return(USB_INT_SUCCESS);
    else return(ERR_USB_UNKNOWN);  /* SET MODE ERROR */
    
}

/* Write the requested data block to the internally specified buffer, and return the length */
UINT8 CH376WriteReqBlock(PUINT8 buf)
{
    UINT8 s, l;
    xWriteCH376Cmd( CMD01_WR_REQ_DATA );
    s = l = xReadCH376Data();
    if ( l ) {
        do {
            xWriteCH376Data( *buf );
            buf ++;
        } while ( -- l );
    }
    xEndCH376Cmd( );
    return( s );
}

/* Write data block to the send buffer of USB host endpoint */
void CH376WriteHostBlock(PUINT8 buf, UINT8 len)
{
    xWriteCH376Cmd( CMD10_WR_HOST_DATA );
    xWriteCH376Data( len );
    if ( len ) {
        do {
            xWriteCH376Data( *buf );
            buf ++;
        } while ( -- len );
    }
    xEndCH376Cmd( );
}

/* Specify offset address to write data block to internal buffer */
void CH376WriteOfsBlock( PUINT8 buf, UINT8 ofs, UINT8 len )
{
    xWriteCH376Cmd( CMD20_WR_OFS_DATA );
    xWriteCH376Data( ofs );  /* Offset address */
    xWriteCH376Data( len );  /* length */
    if ( len ) {
        do {
            xWriteCH376Data( *buf );
            buf ++;
        } while ( -- len );
    }
    xEndCH376Cmd( );
}

/* Set the file name of the file to be operated on */
void CH376SetFileName( PUINT8 name )
{
    UINT8   c;
#ifndef DEF_IC_V43_U
    UINT8   s;
    xWriteCH376Cmd( CMD01_GET_IC_VER );
    if ( xReadCH376Data( ) < 0x43 ) {
        if ( CH376ReadVar8( VAR_DISK_STATUS ) < DEF_DISK_READY ) {
            xWriteCH376Cmd( CMD10_SET_FILE_NAME );
            xWriteCH376Data( 0 );
            s = CH376SendCmdWaitInt( CMD0H_FILE_OPEN );
            if ( s == USB_INT_SUCCESS ) {
                s = CH376ReadVar8( 0xCF );
                if ( s ) {
                    CH376WriteVar32( 0x4C, CH376ReadVar32( 0x4C ) + ( (UINT16)s << 8 ) );
                    CH376WriteVar32( 0x50, CH376ReadVar32( 0x50 ) + ( (UINT16)s << 8 ) );
                    CH376WriteVar32( 0x70, 0 );
                }
            }
        }
    }
#endif
    xWriteCH376Cmd( CMD10_SET_FILE_NAME );
    c = *name;
    xWriteCH376Data( c );
    while ( c ) {
        name ++;
        c = *name;
        /* Force the file name to expire */
        if ( c == DEF_SEPAR_CHAR1 || c == DEF_SEPAR_CHAR2 ) c = 0;
        xWriteCH376Data( c );
    }
    xEndCH376Cmd( );
}

/* Read 32-bit data from CH376 chip and end the command */
UINT32 CH376Read32bitDat( void )
{
    UINT8 c0, c1, c2, c3;
    c0 = xReadCH376Data( );
    c1 = xReadCH376Data( );
    c2 = xReadCH376Data( );
    c3 = xReadCH376Data( );
    xEndCH376Cmd( );
    return( c0 | (UINT16)c1 << 8 | (UINT32)c2 << 16 | (UINT32)c3 << 24 );
}


UINT8 CH376ReadVar8( UINT8 var )
{
    UINT8 c0;
    xWriteCH376Cmd( CMD11_READ_VAR8 );
    xWriteCH376Data( var );
    c0 = xReadCH376Data( );
    xEndCH376Cmd( );
    return( c0 );
}

void CH376WriteVar8( UINT8 var, UINT8 dat )
{
    xWriteCH376Cmd( CMD20_WRITE_VAR8 );
    xWriteCH376Data( var );
    xWriteCH376Data( dat );
    xEndCH376Cmd( );
}

UINT32 CH376ReadVar32( UINT8 var )
{
    xWriteCH376Cmd( CMD14_READ_VAR32 );
    xWriteCH376Data( var );
    return( CH376Read32bitDat( ) );
}

void CH376WriteVar32( UINT8 var, UINT32 dat )
{
    xWriteCH376Cmd( CMD50_WRITE_VAR32 );
    xWriteCH376Data( var );
    xWriteCH376Data( (UINT8)dat );
    xWriteCH376Data( (UINT8)( (UINT16)dat >> 8 ) );
    xWriteCH376Data( (UINT8)( dat >> 16 ) );
    xWriteCH376Data( (UINT8)( dat >> 24 ) );
    xEndCH376Cmd( );
}

void CH376EndDirInfo( void )
{
    CH376WriteVar8( 0x0D, 0x00 );
}

UINT32 CH376GetFileSize( void )
{
    return( CH376ReadVar32( VAR_FILE_SIZE ) );
}

