kirakiseki/ECGMonitor-XiUOS/xiuos/Ubiquitous/Nuttx_Fusion_XiUOS/aiit_board/xidatong-riscv64/src/k210_ch376.c
UINT8   CH376GetDiskStatus( void )
{
    return( CH376ReadVar8( VAR_DISK_STATUS ) );
}

UINT8 CH376GetIntStatus( void )
{
    UINT8 s;
    xWriteCH376Cmd( CMD01_GET_STATUS );
    s = xReadCH376Data( );
    xEndCH376Cmd( );
    return( s );
}

#ifndef NO_DEFAULT_CH376_INT
UINT8 Wait376Interrupt( void )
{
#ifdef  DEF_INT_TIMEOUT
#if DEF_INT_TIMEOUT < 1
    while ( Query376Interrupt( ) == FALSE );
    return( CH376GetIntStatus( ) );
#else
    UINT32  i;
    for ( i = 0; i < DEF_INT_TIMEOUT; i ++ ) {
        if ( Query376Interrupt( ) ) return( CH376GetIntStatus( ) );
    }
    return( ERR_USB_UNKNOWN );
#endif
#else
    UINT32  i;
    for ( i = 0; i < 5000000; i ++ ) {
        if ( Query376Interrupt( ) ) return( CH376GetIntStatus( ) );
    }
    return( ERR_USB_UNKNOWN );
#endif
}
#endif

UINT8 CH376SendCmdWaitInt( UINT8 mCmd )
{
    xWriteCH376Cmd( mCmd );
    xEndCH376Cmd( );
    return( Wait376Interrupt( ) );
}

UINT8 CH376SendCmdDatWaitInt( UINT8 mCmd, UINT8 mDat )
{
    xWriteCH376Cmd( mCmd );
    xWriteCH376Data( mDat );
    xEndCH376Cmd( );
    return(Wait376Interrupt());
}

UINT8 CH376DiskReqSense( void )
{
    UINT8 s;
    up_mdelay( 5 );
    s = CH376SendCmdWaitInt( CMD0H_DISK_R_SENSE );
    up_mdelay( 5 );
    return( s );
}

UINT8 CH376DiskConnect( void )
{
    if ( Query376Interrupt( ) ) CH376GetIntStatus( ); 
    return( CH376SendCmdWaitInt( CMD0H_DISK_CONNECT ) );
}

UINT8 CH376DiskMount( void )
{
    return( CH376SendCmdWaitInt( CMD0H_DISK_MOUNT ) );
}

UINT8 CH376FileOpen( PUINT8 name )
{
    CH376SetFileName( name );
#ifndef DEF_IC_V43_U
    if ( name[0] == DEF_SEPAR_CHAR1 || name[0] == DEF_SEPAR_CHAR2 ) CH376WriteVar32( VAR_CURRENT_CLUST, 0 );
#endif
    return( CH376SendCmdWaitInt( CMD0H_FILE_OPEN ) );
}

UINT8 CH376FileCreate( PUINT8 name )
{
    if ( name ) CH376SetFileName( name );
    return( CH376SendCmdWaitInt( CMD0H_FILE_CREATE ) );
}

UINT8 CH376DirCreate( PUINT8 name )
{
    CH376SetFileName( name );
#ifndef DEF_IC_V43_U
    if ( name[0] == DEF_SEPAR_CHAR1 || name[0] == DEF_SEPAR_CHAR2 ) CH376WriteVar32( VAR_CURRENT_CLUST, 0 );
#endif
    return( CH376SendCmdWaitInt( CMD0H_DIR_CREATE ) );
}

UINT8 CH376SeparatePath( PUINT8 path )
{
    PUINT8  pName;
    for ( pName = path; *pName != 0; ++ pName );
    while ( *pName != DEF_SEPAR_CHAR1 && *pName != DEF_SEPAR_CHAR2 && pName != path ) pName --;
    if ( pName != path ) pName ++;
    return( pName - path );
}

UINT8 CH376FileOpenDir( PUINT8 PathName, UINT8 StopName )
{
    UINT8   i, s;
    s = 0;
    i = 1;
    while ( 1 ) {
        while ( PathName[i] != DEF_SEPAR_CHAR1 && PathName[i] != DEF_SEPAR_CHAR2 && PathName[i] != 0 ) ++ i;
        if ( PathName[i] ) i ++;
        else i = 0;
        s = CH376FileOpen( &PathName[s] );
        if ( i && i != StopName ) {
            if ( s != ERR_OPEN_DIR ) {
                if ( s == USB_INT_SUCCESS ) return( ERR_FOUND_NAME );
                else if ( s == ERR_MISS_FILE ) return( ERR_MISS_DIR );
                else return( s );
            }
            s = i;
        }
        else return( s );
    }
}

UINT8 CH376FileOpenPath( PUINT8 PathName )
{
    return( CH376FileOpenDir( PathName, 0xFF ) );
}

UINT8 CH376FileCreatePath( PUINT8 PathName )
{
    UINT8 s;
    UINT8 Name;
    Name = CH376SeparatePath( PathName );
    if ( Name ) {
        s = CH376FileOpenDir( PathName, Name ); 
        if ( s != ERR_OPEN_DIR ) {
            if ( s == USB_INT_SUCCESS ) return( ERR_FOUND_NAME );
            else if ( s == ERR_MISS_FILE ) return( ERR_MISS_DIR );
            else return( s );
        }
    }
    return( CH376FileCreate( &PathName[Name] ) );
}

#ifdef  EN_DIR_CREATE
UINT8 CH376DirCreatePath( PUINT8 PathName )
{
    UINT8 s;
    UINT8 Name;
    UINT8 ClustBuf[4];
    Name = CH376SeparatePath( PathName );
    if ( Name ) {
        s = CH376FileOpenDir( PathName, Name );
        if ( s != ERR_OPEN_DIR ) {
            if ( s == USB_INT_SUCCESS ) return( ERR_FOUND_NAME );
            else if ( s == ERR_MISS_FILE ) return( ERR_MISS_DIR );
            else return( s );
        }
        xWriteCH376Cmd( CMD14_READ_VAR32 );
        xWriteCH376Data( VAR_START_CLUSTER );
        for ( s = 0; s != 4; s ++ ) ClustBuf[ s ] = xReadCH376Data( );
        xEndCH376Cmd( );
        s = CH376DirCreate( &PathName[Name] );
        if ( s != USB_INT_SUCCESS ) return( s );
        CH376WriteVar32( VAR_FILE_SIZE, sizeof(FAT_DIR_INFO) * 2 );
        s = CH376ByteLocate( sizeof(FAT_DIR_INFO) + STRUCT_OFFSET( FAT_DIR_INFO, DIR_FstClusHI ) );
        if ( s != USB_INT_SUCCESS ) return( s );
        s = CH376ByteWrite( &ClustBuf[2], 2, NULL );
        if ( s != USB_INT_SUCCESS ) return( s );
        s = CH376ByteLocate( sizeof(FAT_DIR_INFO) + STRUCT_OFFSET( FAT_DIR_INFO, DIR_FstClusLO ) );
        if ( s != USB_INT_SUCCESS ) return( s );
        s = CH376ByteWrite( ClustBuf, 2, NULL ); 
        if ( s != USB_INT_SUCCESS ) return( s );
        s = CH376ByteLocate( 0 );
        if ( s != USB_INT_SUCCESS ) return( s );
        CH376WriteVar32( VAR_FILE_SIZE, 0 );
        return( s );
    }
    else {
        if ( PathName[0] == DEF_SEPAR_CHAR1 || PathName[0] == DEF_SEPAR_CHAR2 ) return( CH376DirCreate( PathName ) );
        else return( ERR_MISS_DIR ); 
    }
}
#endif

UINT8 CH376FileErase( PUINT8 PathName )
{
    UINT8 s;
    if ( PathName ) {
        for ( s = 1; PathName[s] != DEF_SEPAR_CHAR1 && PathName[s] != DEF_SEPAR_CHAR2 && PathName[s] != 0; ++ s );
        if ( PathName[s] ) {
            s = CH376FileOpenPath( PathName );
            if ( s != USB_INT_SUCCESS && s != ERR_OPEN_DIR ) return( s );
        }
        else CH376SetFileName( PathName );
    }
    return( CH376SendCmdWaitInt( CMD0H_FILE_ERASE ) );
}

UINT8 CH376FileClose( UINT8 UpdateSz )
{
	return( CH376SendCmdDatWaitInt( CMD1H_FILE_CLOSE, UpdateSz ) );
}

UINT8 CH376DirInfoRead( void )
{
    return( CH376SendCmdDatWaitInt( CMD1H_DIR_INFO_READ, 0xFF ) );
}

UINT8   CH376DirInfoSave( void )
{
    return( CH376SendCmdWaitInt( CMD0H_DIR_INFO_SAVE ) );
}

