kirakiseki/ECGMonitor-XiUOS/xiuos/Ubiquitous/Nuttx_Fusion_XiUOS/aiit_board/xidatong-riscv64/src/k210_ch376.c
UINT8 CH376ByteLocate( UINT32 offset )
{
    xWriteCH376Cmd( CMD4H_BYTE_LOCATE );
    xWriteCH376Data( (UINT8)offset );
    xWriteCH376Data( (UINT8)((UINT16)offset>>8) );
    xWriteCH376Data( (UINT8)(offset>>16) );
    xWriteCH376Data( (UINT8)(offset>>24) );
    xEndCH376Cmd( );
    return( Wait376Interrupt( ) );
}

UINT8 CH376ByteRead( PUINT8 buf, UINT16 ReqCount, PUINT16 RealCount )
{
    UINT8 s;
    xWriteCH376Cmd( CMD2H_BYTE_READ );
    xWriteCH376Data( (UINT8)ReqCount );
    xWriteCH376Data( (UINT8)(ReqCount>>8) );
    xEndCH376Cmd( );
    if ( RealCount ) *RealCount = 0;
    while ( 1 ) {
        s = Wait376Interrupt( );
        if ( s == USB_INT_DISK_READ ) {
            s = CH376ReadBlock( buf );
            xWriteCH376Cmd( CMD0H_BYTE_RD_GO );
            xEndCH376Cmd( );
            buf += s;
            if ( RealCount ) *RealCount += s;
        }
        else return( s );
    }
}

UINT8 CH376ByteWrite( PUINT8 buf, UINT16 ReqCount, PUINT16 RealCount )
{
    UINT8   s;
    xWriteCH376Cmd( CMD2H_BYTE_WRITE );
    xWriteCH376Data( (UINT8)ReqCount );
    xWriteCH376Data( (UINT8)(ReqCount>>8) );
    xEndCH376Cmd( );
    if ( RealCount ) *RealCount = 0;
    while ( 1 ) {
        s = Wait376Interrupt( );
        if ( s == USB_INT_DISK_WRITE ) {
			s = CH376WriteReqBlock( buf ); 
			xWriteCH376Cmd( CMD0H_BYTE_WR_GO );
			xEndCH376Cmd( );
			buf += s;
			if ( RealCount ) *RealCount += s;
		}
		else return( s );
	}
}

#ifdef	EN_DISK_QUERY

UINT8 CH376DiskCapacity( PUINT32 DiskCap )
{
    UINT8   s;
    s = CH376SendCmdWaitInt( CMD0H_DISK_CAPACITY );
    if ( s == USB_INT_SUCCESS ) {
        xWriteCH376Cmd( CMD01_RD_USB_DATA0 );
        xReadCH376Data( );
        *DiskCap = CH376Read32bitDat( );
    }
    else *DiskCap = 0;
    return( s );
}

UINT8 CH376DiskQuery( PUINT32 DiskFre )
{
    UINT8   s;
    UINT8   c0, c1, c2, c3;
#ifndef DEF_IC_V43_U
    xWriteCH376Cmd( CMD01_GET_IC_VER );
    if ( xReadCH376Data( ) < 0x43 ) {
        if ( CH376ReadVar8( VAR_DISK_STATUS ) >= DEF_DISK_READY ) CH376WriteVar8( VAR_DISK_STATUS, DEF_DISK_MOUNTED );
    }
#endif
    s = CH376SendCmdWaitInt( CMD0H_DISK_QUERY );
    if ( s == USB_INT_SUCCESS ) {
        xWriteCH376Cmd( CMD01_RD_USB_DATA0 );
        xReadCH376Data( );
        xReadCH376Data( ); 
        xReadCH376Data( );
        xReadCH376Data( );
        xReadCH376Data( );
        c0 = xReadCH376Data( );
        c1 = xReadCH376Data( );
        c2 = xReadCH376Data( );
        c3 = xReadCH376Data( );
        *DiskFre = c0 | (UINT16)c1 << 8 | (UINT32)c2 << 16 | (UINT32)c3 << 24;
        xReadCH376Data( );
        xEndCH376Cmd( );
    }
    else *DiskFre = 0;
    return( s );
}

#endif

UINT8 CH376SecLocate( UINT32 offset )
{
    xWriteCH376Cmd( CMD4H_SEC_LOCATE );
    xWriteCH376Data( (UINT8)offset );
    xWriteCH376Data( (UINT8)((UINT16)offset>>8) );
    xWriteCH376Data( (UINT8)(offset>>16) );
    xWriteCH376Data( 0 );
    xEndCH376Cmd( );
        return( Wait376Interrupt( ) );
}

#ifdef	EN_SECTOR_ACCESS

UINT8 CH376DiskReadSec( PUINT8 buf, UINT32 iLbaStart, UINT8 iSectorCount )

{
    UINT8 s, err;
    UINT16 mBlockCount;
    for ( err = 0; err != 3; ++ err ) {
        xWriteCH376Cmd( CMD5H_DISK_READ );
        xWriteCH376Data( (UINT8)iLbaStart );
        xWriteCH376Data( (UINT8)( (UINT16)iLbaStart >> 8 ) );
        xWriteCH376Data( (UINT8)( iLbaStart >> 16 ) );
        xWriteCH376Data( (UINT8)( iLbaStart >> 24 ) );
        xWriteCH376Data( iSectorCount );
        xEndCH376Cmd( );
        for ( mBlockCount = iSectorCount * DEF_SECTOR_SIZE / CH376_DAT_BLOCK_LEN; mBlockCount != 0; -- mBlockCount ) {
            s = Wait376Interrupt( );
            if ( s == USB_INT_DISK_READ ) {
                s = CH376ReadBlock( buf );
                xWriteCH376Cmd( CMD0H_DISK_RD_GO );
                xEndCH376Cmd( );
                buf += s;
            }
            else break;
        }
        if ( mBlockCount == 0 ) {
            s = Wait376Interrupt( );
            if ( s == USB_INT_SUCCESS ) return( USB_INT_SUCCESS );
        }
        if ( s == USB_INT_DISCONNECT ) return( s );
        CH376DiskReqSense( );
    }
    return( s );
}

UINT8 CH376DiskWriteSec( PUINT8 buf, UINT32 iLbaStart, UINT8 iSectorCount )
{
	UINT8	s, err;
	UINT16	mBlockCount;
	for ( err = 0; err != 3; ++ err ) {
		xWriteCH376Cmd( CMD5H_DISK_WRITE );
		xWriteCH376Data( (UINT8)iLbaStart ); 
		xWriteCH376Data( (UINT8)( (UINT16)iLbaStart >> 8 ) );
		xWriteCH376Data( (UINT8)( iLbaStart >> 16 ) );
		xWriteCH376Data( (UINT8)( iLbaStart >> 24 ) );
		xWriteCH376Data( iSectorCount );
		xEndCH376Cmd( );
		for ( mBlockCount = iSectorCount * DEF_SECTOR_SIZE / CH376_DAT_BLOCK_LEN; mBlockCount != 0; -- mBlockCount ) {
			s = Wait376Interrupt( );
			if ( s == USB_INT_DISK_WRITE ) {
				CH376WriteHostBlock( buf, CH376_DAT_BLOCK_LEN );
				xWriteCH376Cmd( CMD0H_DISK_WR_GO );
				xEndCH376Cmd( );
				buf += CH376_DAT_BLOCK_LEN;
			}
			else break; 
		}
		if ( mBlockCount == 0 ) {
			s = Wait376Interrupt( );
			if ( s == USB_INT_SUCCESS ) return( USB_INT_SUCCESS );
		}
		if ( s == USB_INT_DISCONNECT ) return( s ); 
		CH376DiskReqSense( ); 
	}
	return( s );
}

UINT8 CH376SecRead( PUINT8 buf, UINT8 ReqCount, PUINT8 RealCount )
{
	UINT8	s;
	UINT8	cnt;
	UINT32	StaSec;
#ifndef	DEF_IC_V43_U
	UINT32	fsz, fofs;
#endif
	if ( RealCount ) *RealCount = 0;
	do {
#ifndef	DEF_IC_V43_U
		xWriteCH376Cmd( CMD01_GET_IC_VER );
		cnt = xReadCH376Data( );
		if ( cnt == 0x41 ) {
			xWriteCH376Cmd( CMD14_READ_VAR32 );
			xWriteCH376Data( VAR_FILE_SIZE );
			xReadCH376Data( );
			fsz = xReadCH376Data( );
			fsz |= (UINT16)(xReadCH376Data( )) << 8;
			cnt = xReadCH376Data( );
			fsz |= (UINT32)cnt << 16;
			xWriteCH376Cmd( CMD14_READ_VAR32 );
			xWriteCH376Data( VAR_CURRENT_OFFSET );
			xReadCH376Data( );
			fofs = xReadCH376Data( );
			fofs |= (UINT16)(xReadCH376Data( )) << 8;
			fofs |= (UINT32)(xReadCH376Data( )) << 16;
			if ( fsz >= fofs + 510 ) CH376WriteVar8( VAR_FILE_SIZE + 3, 0xFF );
			else cnt = 0xFF;
		}
		else cnt = 0xFF;
#endif
		xWriteCH376Cmd( CMD1H_SEC_READ );
		xWriteCH376Data( ReqCount );
		xEndCH376Cmd( );
		s = Wait376Interrupt( );
#ifndef	DEF_IC_V43_U
		if ( cnt != 0xFF ) CH376WriteVar8( VAR_FILE_SIZE + 3, cnt );
#endif
		if ( s != USB_INT_SUCCESS ) return( s );
		xWriteCH376Cmd( CMD01_RD_USB_DATA0 );
		xReadCH376Data( );
		cnt = xReadCH376Data( );
		xReadCH376Data( );
		xReadCH376Data( );
		xReadCH376Data( );
		StaSec = CH376Read32bitDat( );
		if ( cnt == 0 ) break;
		s = CH376DiskReadSec( buf, StaSec, cnt );
		if ( s != USB_INT_SUCCESS ) return( s );
		buf += cnt * DEF_SECTOR_SIZE;
		if ( RealCount ) *RealCount += cnt;
		ReqCount -= cnt;
	} while ( ReqCount );
	return( s );
}

UINT8 CH376SecWrite( PUINT8 buf, UINT8 ReqCount, PUINT8 RealCount )
{
	UINT8	s;
	UINT8	cnt;
	UINT32	StaSec;
	if ( RealCount ) *RealCount = 0;
	do {
		xWriteCH376Cmd( CMD1H_SEC_WRITE );
		xWriteCH376Data( ReqCount );
		xEndCH376Cmd( );
		s = Wait376Interrupt( );
		if ( s != USB_INT_SUCCESS ) return( s );
		xWriteCH376Cmd( CMD01_RD_USB_DATA0 );
		xReadCH376Data( );
		cnt = xReadCH376Data( );
		xReadCH376Data( );
		xReadCH376Data( );
		xReadCH376Data( );
		StaSec = CH376Read32bitDat( );
		if ( cnt == 0 ) break;
		s = CH376DiskWriteSec( buf, StaSec, cnt );
		if ( s != USB_INT_SUCCESS ) return( s );
		buf += cnt * DEF_SECTOR_SIZE;
		if ( RealCount ) *RealCount += cnt;
		ReqCount -= cnt;
	} while ( ReqCount );
	return( s );
}

#endif

