kirakiseki/ECGMonitor-XiUOS/xiuos/Ubiquitous/Nuttx_Fusion_XiUOS/aiit_board/xidatong-riscv64/src/k210_ch376.c
#ifdef	EN_LONG_NAME

UINT8 CH376LongNameWrite( PUINT8 buf, UINT16 ReqCount )
{
	UINT8	s;
#ifndef	DEF_IC_V43_U
	UINT8	c;
	c = CH376ReadVar8( VAR_DISK_STATUS );
	if ( c == DEF_DISK_OPEN_ROOT ) CH376WriteVar8( VAR_DISK_STATUS, DEF_DISK_OPEN_DIR );
#endif
	xWriteCH376Cmd( CMD2H_BYTE_WRITE );
	xWriteCH376Data( (UINT8)ReqCount );
	xWriteCH376Data( (UINT8)(ReqCount>>8) );
	xEndCH376Cmd( );
	while ( 1 ) {
		s = Wait376Interrupt( );
		if ( s == USB_INT_DISK_WRITE ) {
			if ( buf ) buf += CH376WriteReqBlock( buf );
			else {
				xWriteCH376Cmd( CMD01_WR_REQ_DATA );
				s = xReadCH376Data( );
				while ( s -- ) xWriteCH376Data( 0 );
			}
			xWriteCH376Cmd( CMD0H_BYTE_WR_GO );
			xEndCH376Cmd( );
		}
		else {
#ifndef	DEF_IC_V43_U
			if ( c == DEF_DISK_OPEN_ROOT ) CH376WriteVar8( VAR_DISK_STATUS, c );
#endif
			return( s );
		}
	}
}

UINT8 CH376CheckNameSum( PUINT8 DirName )
{
	UINT8	NameLen;
	UINT8	CheckSum;
	CheckSum = 0;
	for ( NameLen = 0; NameLen != 11; NameLen ++ ) CheckSum = ( CheckSum & 1 ? 0x80 : 0x00 ) + ( CheckSum >> 1 ) + *DirName++;
	return( CheckSum );
}

UINT8 CH376LocateInUpDir( PUINT8 PathName )
{
	UINT8	s;
	xWriteCH376Cmd( CMD14_READ_VAR32 );
	xWriteCH376Data( VAR_FAT_DIR_LBA );
	for ( s = 4; s != 8; s ++ ) GlobalBuf[ s ] = xReadCH376Data( );
	xEndCH376Cmd( );
	s = CH376SeparatePath( PathName );
	if ( s ) s = CH376FileOpenDir( PathName, s );
	else s = CH376FileOpen( "/" ); 
	if ( s != ERR_OPEN_DIR ) return( s );
	*(PUINT32)(&GlobalBuf[0]) = 0;  
	while ( 1 ) {
		s = CH376SecLocate( *(PUINT32)(&GlobalBuf[0]) );
		if ( s != USB_INT_SUCCESS ) return( s );
		CH376ReadBlock( &GlobalBuf[8] ); 
		if ( *(PUINT32)(&GlobalBuf[8]) == *(PUINT32)(&GlobalBuf[4]) ) return( USB_INT_SUCCESS ); 
		xWriteCH376Cmd( CMD50_WRITE_VAR32 );
		xWriteCH376Data( VAR_FAT_DIR_LBA );
		for ( s = 8; s != 12; s ++ ) xWriteCH376Data( GlobalBuf[ s ] );
		xEndCH376Cmd( );
		++ *(PUINT32)(&GlobalBuf[0]);
	}
}

UINT8 CH376GetLongName( PUINT8 PathName, PUINT8 LongName ) 
{
	UINT8 s;
	UINT16 NameCount;
	s = CH376FileOpenPath( PathName );
	if ( s != USB_INT_SUCCESS && s != ERR_OPEN_DIR ) return( s );
	s = CH376DirInfoRead( );
	if ( s != USB_INT_SUCCESS ) return( s );
	CH376ReadBlock( GlobalBuf ); 
	CH376EndDirInfo( );
	GlobalBuf[32] = CH376CheckNameSum( GlobalBuf );
	GlobalBuf[33] = CH376ReadVar8( VAR_FILE_DIR_INDEX );
	NameCount = 0;
	while ( 1 ) {
		if ( GlobalBuf[33] == 0 ) {
			s = CH376LocateInUpDir( PathName );
			if ( s != USB_INT_SUCCESS ) break;
			if ( CH376ReadVar32( VAR_CURRENT_OFFSET ) == 0 ) {
				s = ERR_LONG_NAME_ERR;
				break;
			}
			GlobalBuf[33] = DEF_SECTOR_SIZE / sizeof( FAT_DIR_INFO );
		}
		GlobalBuf[33] --;
		s = CH376SendCmdDatWaitInt( CMD1H_DIR_INFO_READ, GlobalBuf[33] );
		if ( s != USB_INT_SUCCESS ) break;
		CH376ReadBlock( GlobalBuf ); 
		CH376EndDirInfo( ); 
		if ( ( GlobalBuf[11] & ATTR_LONG_NAME_MASK ) != ATTR_LONG_NAME || GlobalBuf[13] != GlobalBuf[32] ) {
			s = ERR_LONG_NAME_ERR;
			break;
		}
		for ( s = 1; s < sizeof( FAT_DIR_INFO ); s += 2 ) {
			if ( s == 1 + 5 * 2 ) s = 14;
			else if ( s == 14 + 6 * 2 ) s = 28;
			LongName[ NameCount++ ] = GlobalBuf[ s ];
			LongName[ NameCount++ ] = GlobalBuf[ s + 1 ];
			if ( GlobalBuf[ s ] == 0 && GlobalBuf[ s + 1 ] == 0 ) break;
			if ( NameCount >= LONG_NAME_BUF_LEN ) {
				s = ERR_LONG_BUF_OVER;
				goto CH376GetLongNameE;
			}
		}
		if ( GlobalBuf[0] & 0x40 ) {
			if ( s >= sizeof( FAT_DIR_INFO ) ) *(PUINT16)( &LongName[ NameCount ] ) = 0x0000;
			s = USB_INT_SUCCESS; 
			break;
		}
	}
CH376GetLongNameE:
	CH376FileClose( FALSE );
	return( s );
}

UINT8 CH376CreateLongName( PUINT8 PathName, PUINT8 LongName )
{
	UINT8	s, i;
	UINT8	DirBlockCnt;
	UINT16	count;		
	UINT16	NameCount;	
	UINT32	NewFileLoc;	
	for ( count = 0; count < LONG_NAME_BUF_LEN; count += 2 ) if ( *(PUINT16)(&LongName[count]) == 0 ) break;  
	if ( count == 0 || count >= LONG_NAME_BUF_LEN || count > LONE_NAME_MAX_CHAR ) return( ERR_LONG_NAME_ERR );
	DirBlockCnt = count / LONG_NAME_PER_DIR;
	i = count - DirBlockCnt * LONG_NAME_PER_DIR;
	if ( i ) {
		if ( ++ DirBlockCnt * LONG_NAME_PER_DIR > LONG_NAME_BUF_LEN ) return( ERR_LONG_BUF_OVER );
		count += 2; 
		i += 2;
		if ( i < LONG_NAME_PER_DIR ) {
			while ( i++ < LONG_NAME_PER_DIR ) LongName[count++] = 0xFF;
		}
	}
	s = CH376FileOpenPath( PathName ); 
	if ( s == USB_INT_SUCCESS ) {
		s = ERR_NAME_EXIST;
		goto CH376CreateLongNameE;
	}
	if ( s != ERR_MISS_FILE ) return( s );
	s = CH376FileCreatePath( PathName );
	if ( s != USB_INT_SUCCESS ) return( s );
	i = CH376ReadVar8( VAR_FILE_DIR_INDEX );
	s = CH376LocateInUpDir( PathName ); 
	if ( s != USB_INT_SUCCESS ) goto CH376CreateLongNameE; 
	NewFileLoc = CH376ReadVar32( VAR_CURRENT_OFFSET ) + i * sizeof(FAT_DIR_INFO); 
	s = CH376ByteLocate( NewFileLoc ); 
	if ( s != USB_INT_SUCCESS ) goto CH376CreateLongNameE;
	s = CH376ByteRead( &GlobalBuf[ sizeof(FAT_DIR_INFO) ], sizeof(FAT_DIR_INFO), NULL ); 
	if ( s != USB_INT_SUCCESS ) goto CH376CreateLongNameE;
	for ( i = DirBlockCnt; i != 0; -- i ) {
		s = CH376ByteRead( GlobalBuf, sizeof(FAT_DIR_INFO), &count );
		if ( s != USB_INT_SUCCESS ) goto CH376CreateLongNameE;
		if ( count == 0 ) break; 
		if ( GlobalBuf[0] && GlobalBuf[0] != 0xE5 ) {
			s = CH376ByteLocate( NewFileLoc );
			if ( s != USB_INT_SUCCESS ) goto CH376CreateLongNameE;
			GlobalBuf[ 0 ] = 0xE5;
			for ( s = 1; s != sizeof(FAT_DIR_INFO); s ++ ) GlobalBuf[ s ] = GlobalBuf[ sizeof(FAT_DIR_INFO) + s ];
			s = CH376LongNameWrite( GlobalBuf, sizeof(FAT_DIR_INFO) );
			if ( s != USB_INT_SUCCESS ) goto CH376CreateLongNameE;
			do {
				s = CH376ByteRead( GlobalBuf, sizeof(FAT_DIR_INFO), &count );
				if ( s != USB_INT_SUCCESS ) goto CH376CreateLongNameE;
			} while ( count && GlobalBuf[0] ); 
			NewFileLoc = CH376ReadVar32( VAR_CURRENT_OFFSET ); 
			i = DirBlockCnt + 1;
			if ( count == 0 ) break; 
			NewFileLoc -= sizeof(FAT_DIR_INFO); 
		}
	}
	if ( i ) {
		s = CH376ReadVar8( VAR_SEC_PER_CLUS );
		if ( s == 128 ) {
			s = ERR_FDT_OVER; 
			goto CH376CreateLongNameE;
		}
		count = s * DEF_SECTOR_SIZE;
		if ( count < i * sizeof(FAT_DIR_INFO) ) count <<= 1;
		s = CH376LongNameWrite( NULL, count );
		if ( s != USB_INT_SUCCESS ) goto CH376CreateLongNameE;
	}
	s = CH376ByteLocate( NewFileLoc );
	if ( s != USB_INT_SUCCESS ) goto CH376CreateLongNameE;
	GlobalBuf[11] = ATTR_LONG_NAME;
	GlobalBuf[12] = 0x00;
	GlobalBuf[13] = CH376CheckNameSum( &GlobalBuf[ sizeof(FAT_DIR_INFO) ] ); 
	GlobalBuf[26] = 0x00;
	GlobalBuf[27] = 0x00;
	for ( s = 0; DirBlockCnt != 0; ) {
		GlobalBuf[0] = s ? DirBlockCnt : DirBlockCnt | 0x40; 
		DirBlockCnt --;
		NameCount = DirBlockCnt * LONG_NAME_PER_DIR;
		for ( s = 1; s < sizeof( FAT_DIR_INFO ); s += 2 ) {
			if ( s == 1 + 5 * 2 ) s = 14; 
			else if ( s == 14 + 6 * 2 ) s = 28;
			GlobalBuf[ s ] = LongName[ NameCount++ ];
			GlobalBuf[ s + 1 ] = LongName[ NameCount++ ];
		}
		s = CH376LongNameWrite( GlobalBuf, sizeof(FAT_DIR_INFO) );
		if ( s != USB_INT_SUCCESS ) goto CH376CreateLongNameE;
	}
	s = CH376LongNameWrite( &GlobalBuf[ sizeof(FAT_DIR_INFO) ], sizeof(FAT_DIR_INFO) ); 
CH376CreateLongNameE:
	CH376FileClose( FALSE );
	return( s );
}

#endif
